** Install =memoize=

=memoize= is a great library that can memoize functions.

For example the following code produces the output below.

#+BEGIN_SRC elisp :results output session :exports both
(defvar square-times-called 0)
(defmemoize-by-buffer-contents square (x)
  (setq square-times-called (+ square-times-called 1))
  (print (format "Called `square' for the %d-th time." square-times-called))
  (* x x))

(print (square 6))
(print (square 6))
(print (square 5))
#+END_SRC

#+RESULTS:
#+begin_example

"Called `square' for the 1-th time."

36

36

"Called `square' for the 2-th time."

25
#+end_example

Memoize is used by some utility functions.

#+BEGIN_SRC emacs-lisp
(use-package memoize
 :ensure t)
#+END_SRC

